Revit 2027 API
RebarInSystem.CanApplyPresentationMode Method
 Checks if a presentation mode can be applied for this rebar in the given view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanApplyPresentationMode(
	View dBView
)
Public Function CanApplyPresentationMode (
	dBView As View
) As Boolean
public:
bool CanApplyPresentationMode(
	View^ dBView
)
member CanApplyPresentationMode :
        dBView : View -> bool
Parameters
dBView View
 The view in which presentation mode will be applied.
Return Value
Boolean
 True if a presentation mode can be applied for the given view, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace